package com.mountain.response;

/**
 * @author chzz
 * @version V1.0
 * @Title:
 * @Package GlobalStatusCode
 * @Description: TODO 系统－全局返回状态码
 * @date 2019/2/23
 */

public enum GlobalStatusCode {

    CODE_200(21020000, "操作成功"),

    CODE_401(401, "token认证失败"),
    CODE_402(402, "token签名错误"),
    CODE_403(403, "token已过期"),

    //系统相关
    CODE_400000(400000, "参数语法格式错误"),
    CODE_400001(400001, "身份校验失败,请重新授权"),
    CODE_400002(400002, "参数错误"),
    CODE_400003(400003, "无接口权限,服务器拒绝执行"),
    CODE_400004(400004, "错误的请求"),
    CODE_400005(400005, "明文不能为空!"),
    CODE_400006(400006, "密文不能为空!"),
    CODE_400008(400008, "请求超时,请重试"),
    CODE_400009(400009, "上传图片过大，请上传小于3M的图片"),
    CODE_400010(400010, "图片上传失败,请重试"),
    CODE_400011(400011, "暂无数据"),
    CODE_400012(400012, "网络出了点小问题，请重试!"),
    CODE_400013(400013, "请求消息体过大"),
    CODE_400014(400014, "消息读取失败"),
    CODE_400015(400015, "token不存在"),
    CODE_400016(400016, "注册账号已经存在"),
    CODE_400017(400017, "还存在子菜单，不能被删除"),
    CODE_400018(400018, "不是同一个对象.无法合并"),
    CODE_400019(400019, "无法合并"),

    //公用服务相关
    CODE_500000(500000, "服务器忙,请稍后再试！"),
    CODE_500001(500001, "短信发送失败！"),
    CODE_500002(500002, "无效业务码！"),
    CODE_500003(500003, "验证码2分钟内不重复发送！"),

    //平台用户相关
    CODE_600000(600000, "用户id不能为空！"),
    CODE_600001(600001, "用户不存在！"),
    CODE_600002(600002, "appId格式错误！"),
    CODE_600003(600003, "token已过期！"),
    CODE_600004(600004, "appId为空！"),
    CODE_600005(600005, "secret为空！"),
    CODE_600006(600006, "secret参数错误！"),

    //微信相关
    CODE_700000(700000, "scope参数填写错误，只允许二个值  snsapi_base和snsapi_userinfo"),
    CODE_700001(700001, "code或appid错误"),
    CODE_700002(700002, "发送类型选择错误"),

    //小程序相关
    CODE_800000(800000, "小程序token过期."),

    //支付相关
    CODE_900000(900000, "未找到该订单:"),
    CODE_900001(900001, "金额必须大于1分钱"),
    CODE_900002(900002, "appId错误"),
    CODE_900003(900003, "订单%s关闭错误"),
    CODE_900004(900004, "状态错误, 只允许获得未支付的订单信息"),
    CODE_900005(900005, "openId系统记录不一致"),
    CODE_900006(900006, "提现最低要一块钱"),

    //支付宝相关
    CODE_1000001(1000001, "获取用户信息错误，错误码为:%s-%s-%s"),

    //七牛相关
    CODE_1100001(1100001, "未找到对应token=[%s]的配置，请核实！")
    ;

    // 成员变量
    private int code;
    private String value;

    // 构造方法
    GlobalStatusCode(int code, String value) {
        this.code = code;
        this.value = value;
    }

    public int code() {
        return this.code;
    }

    public String value() {
        return this.value;
    }
}
